{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "7"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "63"}]}}}}, {"name": "StatefulPartitionedCall/model/dense_1/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_1/Relu", "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_2/Relu", "StatefulPartitionedCall/model/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense_3/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "shape": [63, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_3/MatMul/ReadVariableOp", "shape": [128, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_3/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}]}]}